Tekla.Structures.ModelInternal.BuildingHierarchy.Storey
Class for Building Hierarchy Storey

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.parent
Backing field for the parent building of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Elevation
Gets or sets the Elevation of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.LevelOffset
Gets or sets the Level Offset of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Description
Gets or sets the Description of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.BottomOffset
Gets or sets the Bottom offset of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.LevelInfo
Gets or sets the Information of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Parent
Gets or sets the parent building of the storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.BuildingHierarchy.Storey class.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.GetSpaces
Gets all spaces belonging to this storey.
Returns: All spaces belonging to this storey.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Insert
Inserts this Building Hierarchy object into model database. All the attributes must be set.
Returns: True if the object was successfully inserted.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Select
Selects the Building Hierarchy object from model database. The object identifier must be set.
Returns: True if the object was successfully selected.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Modify
Modifies the existing Building Hierarchy object in the model database to match the current one.
Returns: True if the object was successfully modified.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.Delete
Deletes the Building Hierarchy object instance with the given identifier from the model database.
TODO: TTSD-37779 Delete won't work with TeklaModel implementation because dotPluginInterface_ci::DeleteObject fails to find id.
Returns: True if the object was successfully deleted.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.SetManualObjectOverrides(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Manually overrides grouping rules and directly assigns specified model objects to a Building Hierarchy object.
overrideObjects: List of model objects to manually override to this Building Hierarchy item.
Returns: True if all object overrides were successfully set.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.GetManualObjectOverrides
Gets all manually overridden objects from this Building Hierarchy item.
Returns: True if all object overrides were successfully read.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.RemoveManualObjectOverrides(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Removes specified manual overrides from this Building Hierarchy item.
overrideObjects:
Returns: True if all object overrides were successfully removed.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.GetObjects
Gets all ModelObjects that belong to this Storey. The objects still need to be selected separately after calling this method.
Returns: List of unselected ModelObjects that belong to this Storey, either by calculation or manual override.

Tekla.Structures.ModelInternal.BuildingHierarchy.Storey.GetBHType
